PRIZE = -3
PLUS = -1
X2 = -2
BANK = -4

ALPHABET = list("йцукенгшщзхъфывапролджэячсмитьбюё".upper())

STATES_DESCRIPTIONS = {
    PRIZE: "Сектор приз на барабане!",
    PLUS: "А это не работает!",
    X2: "Ваши очки удвоены",
    BANK: "Приумножим вашу сумму на какой-то процент",
}

DRUM_SCORES = [
    0,
    250,
    350,
    PRIZE,
    100,
    750,
    100,
    PLUS,
    250,
    300,
    100,
    500,
    250,
    BANK,
    100,
    350,
    100,
    0,
    100,
    500,
    350,
    PRIZE,
    100,
    X2,
    100,
    PLUS,
    100,
    750,
    250,
    750,
    100,
    BANK,
    300,
    500,
    100
]

EXTRA_DECISIONS = {
    0: "Сектор ноль!",
    BANK: "А вы всё равно банкрот!",
    PRIZE: "Сектор приз на барабане!",
    PLUS: "Сектор плюс на барабане!",

}